[
  {
    "url": "https://www.coursera.org/learn/written-constitution",
    "name": "America's Written Constitution",
    "content": "An introduction to the main themes of the American Constitution—popular sovereignty, separation of powers, federalism, and rights.",
    "what_you_learn": "",
    "instructors": [
      "akhilamar"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/wuli",
    "name": "普通物理學-電磁學、光學及近代物理 (General Physics (1))",
    "content": "物理學是描述世上質量與能量交互作用的學問，在這門課中我們將為大家介紹近代物理對於世界的認識。我們會從電磁學出發，進展到光學，並進而說明近代物理對人類觀念的突破。",
    "what_you_learn": "",
    "instructors": [
      "swchu"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/xdesign-advanced-sketching-and-reference-geometry",
    "name": "xDesign Advanced Sketching and Reference Geometry",
    "content": "Welcome to xDesign Advanced Sketching and Reference Geometry, the second course in the SOLIDWORKS xDesign for Education Specialization. We recommend completing Course 1(xDeisgn Foundations: Sketching and Extrusion) before starting this course.This course dives deeper into 2D sketching techniques and introduces reference geometry tools to enhance your modeling precision and flexibility.\n\nUpon completion of this learning module, you will be able to:\n- Create linear sketch patterns\n- Create circular sketch patterns\n- Create reference planes and axes.\n- Create slots in the sketch profile.\n\nThis course is perfect for learners ready to level up from the basics and tackle more advanced modeling techniques.\n\nSoftware Prerequisites:\n3D Creator\n\nAccess powerful capabilities for Engineering with SOLIDWORKS xDesign at a low price, $72 (excluding taxes), follow this link :  https://go.3ds.com/CXD1",
    "what_you_learn": "",
    "instructors": [
      "~167330664"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/xdesign-assemblies-and-exam-level-part-modeling",
    "name": "xDesign Assemblies and Exam Level Part Modeling",
    "content": "Welcome to xDesign Assemblies and Exam Level Part Modeling, the final course in the SOLIDWORKS xDesign for Education Specialization. Make sure to complete the first four courses for a smooth experience.This course brings together everything you've learned and applies it to real-world part modeling and assembly challenges.\n\nUpon completion of this learning module, you will be able to:\n- Create 3D objects from 2D sketch\n- Create mates in an assembly\n\nThis final step prepares you for real-world projects.\n\nSoftware Prerequisites:\n3D Creator\n\nAccess powerful capabilities for Engineering with SOLIDWORKS xDesign at a low price, $72 (excluding taxes), follow this link :  https://go.3ds.com/CXD1",
    "what_you_learn": "",
    "instructors": [
      "~167330664"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/xdesign-feature-patterns-and-sweeps",
    "name": "xDesign Feature Patterns and Sweeps",
    "content": "Welcome to xDesign Feature Patterns and Sweeps, the fourth course in the SOLIDWORKS xDesign for Education Specialization. Prior knowledge from the earlier courses is strongly recommended.This course teaches powerful modeling tools for creating repetitive or complex geometry efficiently.\n\nUpon completion of this learning module, you will be able to:\n- Create mirror feature\n- Apply linear pattern\n- Apply circular pattern\n- Create sweep / sweep cut\n\nThis course is perfect for learners looking for advanced design scenarios and time-saving model creation. \n\nSoftware Prerequisites:\n3D Creator\n\nAccess powerful capabilities for Engineering with SOLIDWORKS xDesign at a low price, $72 (excluding taxes), follow this link :  https://go.3ds.com/CXD1",
    "what_you_learn": "",
    "instructors": [
      "~167330664"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/xdesign-foundations-sketching-and-extrusion",
    "name": "xDesign Foundations: Sketching and Extrusion",
    "content": "Welcome to xDesign Foundations: Sketching and Extrusion, the first course in the SOLIDWORKS xDesign for Education Specialization.In this course, you will learn how to use SOLIDWORKS xDesign to solve CAD problems. The problems involve creating a 3D object from a 2D sketch using the Extruded Boss/Base feature. You will also learn about the sketch tools & end conditions for extrude feature.\n\nUpon completion of this learning module, you will be able to:\n- Create sketch profiles\n- Extrude the sketch profiles\n- Create sketch fillets/chamfers\n- Convert & Offset Entities in a sketch\n- Create sketch entities using mirror command\n- Use start & end conditions for extrude boss\n\nThis course is ideal for beginners and those new to SOLIDWORKS xDesign, particularly students, educators, and early-career professionals in engineering and design.\n\nSoftware Prerequisites:\n3D Creator\n\nAccess powerful capabilities for Engineering with SOLIDWORKS xDesign at a low price, $72 (excluding taxes), follow this link :  https://go.3ds.com/CXD1",
    "what_you_learn": "",
    "instructors": [
      "~167330664"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/xdesign-revolution-and-cut-features",
    "name": "xDesign Revolution and Cut Features",
    "content": "Welcome to xDesign Revolution and Cut Features, the third course in the SOLIDWORKS xDesign for Education Specialization. To get the most out of this course, you should first complete the previous two courses in the series.This course focuses on feature refinement and advanced geometry creation using cuts and revolved features.\n\nUpon completion of this learning module, you will be able to:\n- Create extruded cuts\n- Apply fillets/chamfers\n- Create revolve boss\n- Apply revolve cut\n\nThis course is ideal for learners who want to explore new tools for creating axisymmetric objects and refining their designs. \n\nSoftware Prerequisites:\n3D Creator\n\nAccess powerful capabilities for Engineering with SOLIDWORKS xDesign at a low price, $72 (excluding taxes), follow this link :  https://go.3ds.com/CXD1",
    "what_you_learn": "",
    "instructors": [
      "~167330664"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/xila-zhexue",
    "name": "活用希臘哲學 (Understanding the Greek Philosophy)",
    "content": "本課程之教學內容以希臘哲學之發展為主，並輔以哲學對人生意義之說明。希臘哲學是西洋哲學的骨幹，呈現西方人思維的核心理念，不但足以解釋今日之西方世界，甚至可以說明全世界的發展趨勢。本課程以希臘哲學為教學之主幹，分為先蘇哲學、詭辯學派、蘇格拉底、柏拉圖、亞理斯多德五個階段。教學的方式以強調他們之間的不同與相同的部分。課程將以演講的方式進行，揉合日常經驗作說明，並不時地會以整體的角度回頭看希臘哲學在今日哲學與社會所扮演的角色。",
    "what_you_learn": "",
    "instructors": [
      "yuann"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/xin-li-xue-sheng-huo",
    "name": "心理学与生活",
    "content": "心理学很神秘？你会发现，只要有人的地方，就有心理学！心理学很深奥？你会发现，似乎每个人都是大众心理学家，谁都可以说点“心理学”。\n的确，我们生活中处处都是心理学！但这门课程却要告诉你，我们常常挂在嘴边的“心理学”绝大部分是错的，剩下的一小部分也是不全面的。\n在本课程中，我们会一起把看似复杂的心理学理论运用到简单的生活现象中，在理解和掌握心理规律和原理后，用独具的慧眼看到一个与原先完全不同的生活世界。",
    "what_you_learn": "",
    "instructors": [
      "cckcck"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/xingfa-xue-zong-lun",
    "name": "刑法学总论 Criminal Law",
    "content": "刑法是规定犯罪与刑罚的法律。刑法学是研究刑法的科学，主要研究犯罪的成立条件以及刑罚的种类与适用刑法的制度等问题。本课程的主要目的是简明完整地说明现代刑法学总论的基本概念、基本理论与基本方法，包括的主要内容有刑法与刑法学的基本概念，刑罚的正当性，罪刑法定原则，刑法解释，刑法的适用范围，犯罪与犯罪构成的概念，犯罪构成的主要内容，排除犯罪的根据，犯罪的未完成状态，共同犯罪，刑罚的概念与体系，量刑制度，数罪并罚，缓刑、减刑与假释。本课程通过理论说明与案例分析对有关问题进行讲解，鼓励同学们通过刑法发展来认识刑法的生命，通过刑法比较来认识刑法的国际标准，通过确立刑法理想来追求社会的公平正义。本课程将系统完整地说明、分析现代刑法学总论中的基本概念、基本理论。同学们通过本课程的讲述、案例的讨论、理论的分析，可以对现代刑法学知识的基本使用方法有一个完整的理解，从而有助于理解与分析现代社会面临的刑法问题。",
    "what_you_learn": "",
    "instructors": [
      "szwang"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/xinxi-shehui",
    "name": "信息社会的机遇和挑战",
    "content": "通过本门课程，你将能够清楚地认识到当今社会我们面临的机遇和挑战，社会未来的发展趋势与需求，这样我们才能找准自己的位置，确定自己未来的发展方向。这门课程中我将从宏观到微观，从历史到现实，分析社会的发展规律，明晰我们每个人与这个社会的关系。这门课看似与提升生产力并无关系，但事实上，它是后面课程的基础，也是你学习后面内容的动力所在。",
    "what_you_learn": "",
    "instructors": [
      "luozhaofeng"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/yingyang-jiankang",
    "name": "营养与健康",
    "content": "《营养与健康》介绍营养学基础知识，主要内容包括：人体所需的七大营养素的化学结构、主要生理功能、食物来源、人体每天的参考摄入量等；主要食物种类包括谷物类、薯类、豆类、坚果类、蔬菜类、水果类、肉类、水产品类、蛋类、乳制品类的营养价值；营养与疾病特别是一些慢性、高发性疾病如高血糖、高血脂、高血压、癌症等的关系。内容简单，适合无营养学基础、但希望了解一般的营养学知识，改善日常膳食质量的人选修。",
    "what_you_learn": "",
    "instructors": [
      "wjzheng"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/yingyuyanjiang",
    "name": "Essentials for English Speeches and Presentations  英语演讲与演示",
    "content": "Students must learn essential knowledge and skills to deliver an impressive English speech or presentation for academic purposes, job hunting, and business occasions. Global perspectives and inter-cultural communication skills are taught here to facilitate most Chinese English learners.学习在学术交流、求职、海外留学与商务场景下进行英文演讲与演示所必备的知识与技能，强化中国学生的全球化视角与跨文化沟通技巧。",
    "what_you_learn": "",
    "instructors": [
      "drzhypku"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/yoga",
    "name": "大学生瑜伽",
    "content": "本课程是面向当代在校大学生开设的一门网络体育课程——大学生瑜伽，是一门能够促进大学生身心平衡的养心健身类课程。课程根据大学生的身心特点进行设计,课程内容以体式练习为主，体式动作由易渐难，由个别到组合，辅以瑜伽呼吸和冥想及休息术的练习，通过10周的教习,使同学们掌握基本的瑜伽运动规律,掌握一项终身体育锻炼技能，养成终身体育的习惯和健康生活的理念。第一周和第二周教学内容包括理论部分和体式部分，使大家对瑜伽运动有一个基本的了解与体验。第三周至第十周，每节课围绕一个核心主题，详细讲授3个主要体式动作，然后是30-45分钟的组合体式练习（分为2-3个视频），每节课的组合体式练习开始前有瑜伽冥想，体式练习结束后有瑜伽休息术，建议大家跟随视频的顺序进行练习，不要忽略冥想和休息术的部分。第十一周课程是对瑜伽练习过程中可能出现的主要疑问的解答，可以在第三周课程之前学习，或在任何需要的时候，进行反复观看。",
    "what_you_learn": "",
    "instructors": [
      "qixin"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/yoga-sjtu",
    "name": "循序渐进练瑜伽",
    "content": "本课程以上海市精品课程《瑜伽与健康》为基础，以生理学、解剖学和教育学等相关理论为指导，结合在线开放课程的特点进行了针对性的教学设计，不同基础的练习者均能获益。通过学习您将收获到：1.安全有效练习瑜伽的方法：由易到难、由简到繁，系统了解瑜伽的练习步骤和完整体系；\n2.学会瑜伽动作与瑜伽呼吸法：掌握26个基础瑜伽体式、3种呼吸控制法；\n3.健美形态，缓解压力，增强体质：动作学习部分均包括“跟我学”和“跟我练”两个组分，注重精讲多练，在反复练习中扎实掌握动作技巧，享受练习瑜伽的乐趣；\n4.如何避免瑜伽损伤：通过专题访谈、专题理论、课外拓展等板块，学习相关运动生理学和解剖学基础知识，安全有效地练习瑜伽；\n5.提高瑜伽技术水平，促进身心全面发展：分类考核、分类评价，对校外学习者技术动作进行视频点评并给予针对性改进建议；在单元练习与课堂互动中不断进步，将瑜伽练习自然融入日常生活。",
    "what_you_learn": "知识传授：\n知识传授：\n以掌握26种瑜伽基础体式、3种主要呼吸法的要领和科学练习的方法与步骤，对瑜伽练习中的常见问题能够客观辨别和分析。\n以掌握26种瑜伽基础体式、3种主要呼吸法的要领和科学练习的方法与步骤，对瑜伽练习中的常见问题能够客观辨别和分析。\n能力培养：\n能力培养：\n自觉主动练习瑜伽的能力、大众媒体宣传中瑜伽知识真伪的辨别能力。\n自觉主动练习瑜伽的能力、大众媒体宣传中瑜伽知识真伪的辨别能力。\n情感认知：\n情感认知：\n学会内省，培养自律精神，树立终身锻炼的意识。\n学会内省，培养自律精神，树立终身锻炼的意识。",
    "instructors": [
      "~56749340"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/youth-health",
    "name": "Global Adolescent Health",
    "content": "This course will explore the dynamic factors affecting the health and wellbeing of young people around the world, and how important it is for individuals, communities and nations that we improve the health and life chances of this important population group.With over 25% of the world’s population aged between 10 and 24 years, today’s generation of young people is the largest in human history. As the future leaders and drivers of growth, productivity and innovation, young people are our greatest assets, and investment in their health and wellbeing has social, economic and other benefits that continue across the lifespan and into the next generation.\n\nIn this course we will adopt a life-course framework to take a holistic view of youth health and wellbeing. We will explore changing patterns of adolescent health and development, including why adolescence is starting earlier and ending later; how puberty and adolescent brain development may shape future health; and how what happens in adolescence can affect the start to life for the next generation. We’ll also look at the major health and social issues affecting young people and ways of addressing these through policy, practice and programming.\n\nCOURSE FORMAT:\nThis course comprises short video lectures and interviews, required and recommended readings, online discussion, quizzes and written assignments. There is no required text for this course and all readings are provided.\n\nDO I HAVE TO PAY FOR THIS COURSE?\nNo- you may access 100% of material in this course for free. You are also welcome to do as much or as little of the course as you like, including all (or none!) of the assessment tasks- it all depends on your learning goals. The option to pay for this course is there for those who wish to receive a Course Certificate as evidence of completion (which does require you to attempt and successfully pass the assessment tasks). \n\nWHO IS THIS COURSE FOR?\nThis course will be relevant for anyone with an interest in the health and wellbeing of young people. You do not need to be of any particular personal or professional background to benefit from this course, but having some basic undergraduate study experience will be helpful to your learning (particularly if in a health related field).\n\nWHAT IS THE MOST INTERESTING THING I'LL LEARN IF I TAKE THIS COURSE?\nYou’ll learn how so much of what happens during adolescence can impact not only the future health of individuals, but the health of the next generation as well. You’ll develop a greater understanding of the key factors impacting upon youth health and learn how to be a better advocate for the health and wellbeing of young people.\n\nView the MOOC promotional video here: http://tinyurl.com/z5l4mod",
    "what_you_learn": "",
    "instructors": [
      "susansawyer",
      "georgepatton"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/youth-sports",
    "name": "The Science of Training Young Athletes",
    "content": "Seventy percent of kids drop out of sports before their high school graduation. Only 15% leave because they feel they are not good enough. Almost 70% leave because they were not having fun, or due to problems with the coach. Injuries cause 30% to give up sports. This course is packed full of practical sports science information that provide youth coaches and parents with the practical pediatric sports science insights to successfully retain young athletes and develop their sport potential while avoiding injury and overtraining. We begin by examining the multidimensional nature of coaching, the relevant sport motor performance abilities, the impact of growth and development on motor skills, the gene versus practice controversy, and briefly overview the body structures strengthened through training. Then we explore the athlete's energy supply, where this energy comes from, and how it matures along with the athlete. Finally, we examine the development of strength, power, anaerobic capacity, coordination and flexibility through the life span.The optional text manual for this course is available at: http://www.learnitez.com/HighPerformanceScience/manuals/",
    "what_you_learn": "",
    "instructors": [
      "~12414883"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/youtube-content-creation-essentials",
    "name": "YouTube Content Creation Essentials",
    "content": "This course equips you with the fundamental skills needed to produce high-quality YouTube videos. You'll master the entire video production workflow, from writing compelling scripts to recording and editing professional-looking content. You'll learn accessible production techniques using smartphones and entry-level editing software, allowing you to create engaging content without expensive equipment. By the end, you'll be able to confidently plan, shoot, and edit videos that capture viewer attention.By the end of this course, you will be able to:\n\n- Write engaging video scripts and storyboards\n- Produce professional-quality video content using basic equipment\n- Create attention-grabbing thumbnails and video graphics\n- Develop efficient content production workflows\n- Apply fundamental video and audio editing techniques",
    "what_you_learn": "Learn the basics of creating high-quality YouTube content\nLearn the basics of creating high-quality YouTube content",
    "instructors": [
      "~47377817"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/youtube-video-editing-in-fcpx---from-beginner-to-pro",
    "name": "YouTube Video Editing in FCPX - From beginner to Pro",
    "content": "Welcome to this comprehensive online course designed to equip aspiring YouTube content creators with the necessary skills and knowledge to create high-quality videos using Final Cut Pro X (FCPX).Whether you're a beginner with no prior experience in video editing or an intermediate user looking to elevate your editing techniques, this course will guide you through the entire process, from the basics to advanced techniques.\n\nThrough a combination of instructional videos, practical exercises, and real-world examples, this course will demystify FCPX and empower you to unleash your creativity in producing engaging YouTube content. With its user-friendly interface and powerful editing tools, Final Cut Pro X is the preferred choice of many professional YouTubers and video editors.\n\nKey Learning Objectives:\n\nFCPX Interface and Workflow: Gain a thorough understanding of the FCPX interface, navigation, and workflow to efficiently edit your YouTube videos.\n\nImporting and Organizing Footage: Learn how to import your video and audio files into FCPX, organize your media library, and establish an efficient file management system.\n\nBasic Editing Techniques: Master fundamental editing techniques, such as trimming, splitting, and rearranging clips to create a coherent and engaging narrative flow.\n\nEnhancing Visuals and Audio: Discover how to enhance your videos by applying color correction, adding transitions, incorporating visual effects, and optimizing audio quality.\n\nAdvanced Editing Techniques: Explore advanced editing techniques, including multicam editing, green screen compositing, and incorporating motion graphics to elevate your video production quality.\n\nTitles, Graphics, and Lower Thirds: Learn how to create captivating titles, graphics, and lower thirds to enhance the visual appeal and professionalism of your YouTube videos.\n\nOptimizing for YouTube: Understand the best practices for exporting, compressing, and uploading your videos to YouTube while maintaining optimal quality and file size.\n\nCollaboration and Workflow Efficiency: Discover strategies for collaborating with other creators, managing multiple projects, and utilizing FCPX's organizational tools effectively.\n\nProject Organization and Backup: Develop efficient project organization and backup strategies to ensure the safety and accessibility of your video files.\n\nWorkflow Automation and Time-Saving Tips: Explore workflow automation techniques and time-saving tips to speed up your editing process and increase productivity.\n\nBy the end of this course, you will have gained the skills and confidence to edit YouTube videos like a professional using Final Cut Pro X. Whether you aspire to create vlogs, tutorials, or cinematic masterpieces, this course will empower you to tell your stories effectively and engage your YouTube audience with visually stunning and captivating content.\n\nInstructor bio:\nLambros (Lamz) is an educator and entrepreneur dedicated to helping creators turn their knowledge into thriving businesses. With over 60,000 students worldwide, he has built a successful Course Creation Academy that empowers teachers to become entrepreneurs.\nThrough proven strategies and hands-on coaching, Lambros teaches the core principles of content creation—helping creators identify the right audience, design impactful info-products, and build sustainable income around their passions. His mission is to guide individuals into the digital renaissance, transforming expertise into opportunity.",
    "what_you_learn": "",
    "instructors": [
      "~186501695"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/youxi-chanye-gailun",
    "name": "游戏产业概论",
    "content": "本课程为“初级课程”，为了适应初学者需求，章节安排分为三个板块。1-5章为初学者进行了知识普及和铺垫，6-7章为学员了解行业做进一步介绍，8-9章带领学员深入中国游戏行业了解产业发展和产品运营，层层进阶、循序渐进。而课程二《游戏策划与设计》整体知识难度将有升级，重视实操，请学员做好准备。从游戏诞生之初至今已走过半个多世纪。但许多人任认为游戏产业并未成熟，然而其高速发展的势头引人注目。蕴含市场潜力的游戏产品推陈出新，品类丰富多样，终端靓丽时尚，游戏玩家人数激增，游戏产业逐渐成为欧、美、日、韩等国创意经济新的增长点。本课程包括游戏起源、游戏发展史、游戏分类、游戏的研发制作流程、世界游戏产业纵览和知识产权保护等章节，为培养成熟的游戏产业市场经理人打下良好基础。",
    "what_you_learn": "",
    "instructors": [
      "hudongyan"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/yuzhou-duihua",
    "name": "宇宙之旅：对话 (Journey of the Universe: Weaving Knowledge and Action)",
    "content": "宇宙之旅是由不断进步的科学发现和人文科学交织组成的，历史、哲学、艺术、宗教统统都含括在内。这门课由一系列20个与科学家与环境学家关于宇宙之旅的访谈组成。前10个访谈是与科学家和历史学家的访谈，它们帮助我们深化对宇宙、地球、人类进化过程的理解。后10个访问是与环境学家、教师和艺术家的访谈，它们探索了宇宙奥义和人类社会之间的联系。",
    "what_you_learn": "",
    "instructors": [
      "maryevelyn-tucker",
      "john-grim"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/yuzhou-zhi-lu",
    "name": "宇宙之旅：展现生命 (Journey of the Universe: The Unfolding of Life)",
    "content": "关于这门课程：宇宙之旅是由不断进步的科学发现和人文科学交织组成的，历史、哲学、艺术、宗教统统都含括在内。这门课以艾美奖获奖影片-宇宙之旅，以及耶鲁大学出版社出版的课本作为主要教材。旅程探索了宇宙的进化，这些进化就像是一套建立在关联、独立和进化之上的奇妙过程。它带我们重新审视星系、地球、生命和人类社会之间的动态交互。它探索了我们了解进化的过程以及对人类和生态环境的启示。\n\n因此，这门旅行课程是自然科学和人文科学的融合。这趟旅行是以一种史诗旁白的形式进行推进的，而不是讲述一系列遵从自然科学的事实。这会改变我们的认知并让我们可以将自身带入到旁白之中。通过这种代入感，我们可以更好的理解这一系列过程的复杂性和美感，例如自组织演化、自然选择、进化、协作、协同进化。当我们发现了解了了这些错综复杂的进化过程之后，我们突然发现到我们所生活的地球正处在其自身历史上的重要转折点，纷繁复杂却又美轮美奂。",
    "what_you_learn": "",
    "instructors": [
      "maryevelyn-tucker",
      "john-grim"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/z-commands-and-panels",
    "name": "Getting Started on Mainframe with z/OS Commands and Panels",
    "content": "Getting Started with the IBM Mainframe with z/OS Commands and Panels is a mostly hands-on in an IBM Mainframe z/OS Environment. A total of seven labs will provide live access to an IBM Z server. The labs are designed to teach you the fundamental practical skills to navigate and work in a z/OS environment. This includes the use of ISPF/PDF dialogs, and TSO/E commands.On successful completion of this course, the learners are eligible to claim the Getting Started on Mainframe with z/OS Commands and Panels badge. More information can be found here:\nhttps://www.youracclaim.com/org/ibm/badge/getting-started-on-mainframe-with-z-os-commands-and-panels",
    "what_you_learn": "Review the main concepts of z/OS\nReview the main concepts of z/OS\nLog on to TSO and start ISPF/PDF\nLog on to TSO and start ISPF/PDF\nNavigate through ISPF/PDF dialogs and use the basic ISPF/PDF functions and the ISPF Editor\nNavigate through ISPF/PDF dialogs and use the basic ISPF/PDF functions and the ISPF Editor\nUse ISPF/PDF to allocate data sets and edit data sets using the ISPF Editor primary and line commands\nUse ISPF/PDF to allocate data sets and edit data sets using the ISPF Editor primary and line commands",
    "instructors": [
      "~31623304"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zarchitecture-assembler-language-part-1-the-basics",
    "name": "z/Architecture Assembler Language Part 1: The Basics",
    "content": "Welcome to z/Architecture Assembler Language Part 1: The Basics, the first course three part series for the z/Architecture Assembler Language.This course provides an introduction to z/Architecture and the Assembler language, covers binary and hexadecimal arithmetic, the basics of z/Architecture, and the Assembler language syntax. The goal of this course is to give you the basic knowledge necessary to understand the other courses in the z/Architecture Assembler Language series. There are no hands-on labs in this course.\n\nBy the end of this course, you will be able to:\n- Understand binary and hexadecimal number representations and convert them to/from decimal.\n- Recognize architectural features, such as instruction formats, data representation, and storage addressing.\n- Understand the Assembler language syntax, and code Assembler statements that reserve and initialize areas in storage.\n- Code Assembler statements that make up a (very) simple program.\n\nThis is an intermediate course, intended for learners with a background in computer science. To succeed in this course, you should have basic knowledge of computer programming and computer architecture.",
    "what_you_learn": "Understand binary and hexadecimal number representations and convert them to/from decimal.\nUnderstand binary and hexadecimal number representations and convert them to/from decimal.\nRecognize architectural features, such as instruction formats, data representation, and storage addressing.\nRecognize architectural features, such as instruction formats, data representation, and storage addressing.\nUnderstand the Assembler language syntax, and code Assembler statements that reserve and initialize areas in storage.\nUnderstand the Assembler language syntax, and code Assembler statements that reserve and initialize areas in storage.\nCode Assembler statements that make up a (very) simple program.\nCode Assembler statements that make up a (very) simple program.",
    "instructors": [
      "~31623304"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zhexue-daolun",
    "name": "哲学导论（中文版）",
    "content": "本课程将为你介绍现代哲学中的一些研究领域。在每个模块中，将由不同的哲学家为你讲述其专业领域内最重要的疑问和问题。 首先，我们来了解什么是哲学，哲学有哪些独特的目标与方法以及哲学与其他学科有何不同？之后，我们会在课程剩余的时间内向你简要介绍各种哲学领域的总体情况。你要学习的主题包括：知识论，其中将讨论囊括我们对世界和我们自身的了解以及如何获取这些知识；科学哲学，我们将在此模块中调查科学研究和实践中的基础概念问题；心灵哲学，我们将在此模块中询问物质拥有心灵的意义以及应如何理解和诠释心灵；道德哲学，我们将在此模块中探究道德判断和反应的本质，看它们是旨在得出客观的道德真相，还是仅作为个人或文化偏好，以及，形而上学，我们将在此模块中思考有关事实本质的一些基础概念问题。 本慕课 (MOOC) 课程由爱丁堡大学 Eidyn 研究中心领导设计。为配合“哲学导论”的授课，我们为大家倾力推荐一本由 Routledge 出版社出版的名为 \"Philosophy for Everyone\" 的配套书籍。这本“哲学导论”的课程配套书籍是由爱丁堡大学哲学小组为满足慕课 (MOOC) 学生要求而编写的。\"Philosophy for Everyone\"一书中包含清晰易懂的章节、章节摘要、词汇表、探究问题、补充阅读推荐以及在线资源指南。This is a translated version. To join the original English version, Please visit this page https://www.coursera.org/learn/philosophy",
    "what_you_learn": "",
    "instructors": [
      "~1935223",
      "~1935218",
      "~1604596",
      "~1935209",
      "~1935226",
      "duncan-pritchard",
      "~1935212"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zhong-yao-zhi-shi",
    "name": "杏林探宝——认知中药",
    "content": "《杏林探宝——认知中药》是由上海中医药大学推出的一门关于中药学的慕课课程，由上海中医药大学杨柏灿教授主讲。上海中医药大学（Shanghai University of Traditional Chinese Medicine）的前身是上海中医学院，创建于1956年，是新中国诞生后国家首批建立的四所中医药高等院校之一，也是上海市属高校中唯一的一所医科类重点特色院校。\n      中药学根植于中华文化，是中医药学的重要组成部分，也凝聚着中华文明的精髓。其悠久的历史，卓越的防病治病效果，较少的毒副作用，成为中华民族防病治病不可或缺的选择。同时，中药的作用也日益引起国际社会的关注和重视。但不可否认，对中药的认识和应用存在着一些不容忽视的误区与盲区，非常有必要采取一定的方式，通过合适的平台传播、普及中药知识，使人们对中药有一个更为全面准确的认识，并能合理应用，让中药为人类的健康保健发挥更大的作用。",
    "what_you_learn": "",
    "instructors": [
      "bcyang"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zhong-yi-yao-wen-hua",
    "name": "中医药与中华传统文化",
    "content": "谈到中华传统文化，大家首先想到的莫过于以孔子思想为代表的儒学思想，但中华传统文化绝不止这些；谈到中医药，大家第一印象可能是针灸、按摩，因为她们已经走向全球，但中医药也远不止如此。医学、生物学飞速发展的21世纪，中医药学这一古老学科为什么还有生命力？她与现代医药学有何不同？为什么很多人觉得中医药知识体系不容易学习和掌握？因为：中医药学具有深厚的中华传统文化背景，如果不了解中华传统文化，就难以深入理解中医药学的思想和知识。本课程就是希望通过剖析中医药与中华传统文化的密切联系，使大家了解中医药学的中华传统文化的背景，更容易理解中医药的思维特征、思想特色和知识体系。通过本课程的学习，不仅能掌握一些中医药的基本知识、中医药养生的原理和方法，还能从中医药的视角认识中华传统文化的精髓。",
    "what_you_learn": "",
    "instructors": [
      "pcssjtu"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zhongguorenwenjingdiandaodu",
    "name": "中國人文經典導讀",
    "content": "本課程對象為對中國文化有興趣的同學。課程目的為通過四個不同特色的主題，討論中國文化的四個主要面向。每個主題選取兩篇經典文本作為核心閱讀，並與延伸閱讀做互文探討，以新角度解讀經典文本的意義，展現中國文化的複雜性、多元性。文本難度與大學一年級國文程度相當。",
    "what_you_learn": "",
    "instructors": [
      "leeoufan",
      "tsuiwai",
      "likkwancheung"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zhongri-jiaoliushi",
    "name": "中日文化交流史",
    "content": "追溯日本文明发展的历史，阐明日本人独特的思考模式，解析日本独特的审美意识。本课程讲授公元前3世纪至清末的中日文化交流的历史。以文化艺术的交流为主线，以实地考察为背景展示了中日两国丰富灿烂的交流史实。通过中日双方在吸收对方文化过程中所表现出来的不同的受容方式剖析了中日文化之不同特性，可以帮助受课者准确地把握日本文化的内质，并启发其对自我民族历史文化之思考。生动的图片，倾心的讲授，可以让学习者在轻松愉快的氛围中完成六章的学习和有趣的试题，以期丰富学习者的人文积淀。",
    "what_you_learn": "",
    "instructors": [
      "~24703845"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zhuangzi",
    "name": "莊子─姿勢、意識與感情 (Zhuangzi─Posture, Awareness, and Sentiment)",
    "content": "他這麼活過他的一生，留下一本書，《莊子》。這本書影響了陶淵明的一生，影響了李太白的一生，影響了白居易的一生，影響了蘇東坡的一生。唐玄宗下詔稱此書為《南華真經》，尊莊子為南華真人。清初名評論家金聖歎，評定這本書是「天下第一才子書」。才子必讀，欲成才者必讀。如果你醉心於技進於道、技道合一的職人文化，追本溯源，請讀《莊子》。如果你不想成材、不想在優勝劣敗的競走中疲憊一生，也請讀《莊子》。如果想處於才與不才之間、想在人生的驚濤駭浪間存活、無傷，更錬就日益精進的乘御之力，就請打開《莊子》。\n\n　「福輕乎羽，莫之知載。禍重乎地，莫之知避。」（《莊子．人間世》）\n\n　　莊子所處的戰國時代，平民百姓能擁有的福份比羽毛還要輕薄，飄忽不定不知道要怎樣才能承接、擁有；可是災難禍患卻比山河大地還要沈重，想要閃避卻不知道有什麼方法能全身而退。當時，一次戰爭裡被斬首、殺害的士卒多達數萬、數十萬人。\n\n　　而莊子，就在這麼個布滿羅網、暗藏凶器的時代社會裏，擔任一個小小漆樹園的，小小吏。\n\n　　必須承受、最能感受時代之傷的，莫過於金字塔底層。\n　　是戰國中期的莊子，也是當代的你我。\n　　蕭條異代都同樣湧動著如風浪翻滾、層出不窮的普世之傷。\n\n　　與莊子為友，在李白之後、東坡之後，在詩人、哲人、職人與成千上萬因此改變姿勢、意識與用情的人們之後，本季課程將陪你逐字逐句讀完莊子親筆內七篇中的前三篇〈逍遙遊〉、〈齊物論〉、〈養生主〉，而莊周在此中斷續鋪陳、輻輳的三個主題：姿勢、意識與感情，也將在逐字逐句的講解中豁然胸次。──你會發現，原來只要把注意力收回自身，心就可以不煩、不亂、不痛。原來只要掌握正確的姿勢原則，身體竟可以如此輕靈放鬆。原來感情可以不執著、不陷溺，只要懂得深情而不滯於情。原來身心的安定，是面對混亂的時代最有力量的武器。\n\n　　時局板蕩，曖昧天光，半部《論語》治天下，半部《莊子》治身心，正是時候，好好讀《莊子》。\n\n　　為使聽者易於掌握《莊》學大旨，將〈逍遙遊〉、〈齊物論〉、〈養生主〉各分為三、五、五章，各章下依長度略分小節；並設計體驗古典單元，使能活用於日常。",
    "what_you_learn": "",
    "instructors": [
      "biming"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zhuangzi2",
    "name": "莊子─人情 (Zhuangzi─Between People)",
    "content": "「我很想從七歲起就跟你一起長大。」這是我今生聽過最美的情話。年過五十的今天，我把今生聽過最美的情話，輕輕對莊子說。\n\n        彼時迷途，求學阡陌縱使規矩昭然，卻沒有一條路能看見遠方。\n        那年錯愛，蹉跎青春，只換來心碎。此刻紅塵，被職場的權力關係層層綑綁，動輒得咎。\n        多少次，我們種瓜卻不得瓜，給愛卻不被愛，理直卻更難容身！\n        置身人間世，要如何才能心身無傷、全身而退？\n\n〈人間世〉幫助我們及早看清，並籌謀對策\n\n        上回，《莊子．逍遙遊》提出人生目標的設定，〈齊物論〉傳授如何泯除分別、平息攪擾的齊物攻略，〈養生主〉兼括身體技術、心靈工夫與用情原則的養生大要。這回，莊子帶領讀者親臨現場，面對複雜紛擾的人情，不復完好、支離破碎的世界，儒家的至聖與亞聖說：我們可以選擇逃離（「危邦不入，亂邦不居」、「是故知命者，不立乎巖牆之下」）；莊子卻鼓勵我們熱情擁抱，當拯濟天下的大醫（「治國去之，亂國就之。醫門多疾」）。但這艱難的醫國行為，並非汲汲朝外奔走，而是從徹底療癒、強化自我心身開始──須先確立自己，才有能力樹立別人。〈人間世〉的七則小故事，無論是討論事君之道或處亂世之方，在在都寄寓了莊子學說最重要的心靈功課。能夠做到心情靜定，再佐以傳話、勸諫的原則以及人際網絡中的應對進退之方，才有機會達成溝通、教化的目的。\n        莊子並帶我們深刻反思，是否因過於重視世俗價值的「有用」，竟忽略更根本、重要的心與身？倘能由保全心身的立場，從「人，才是目的」的角度出發，便可發現看似「無用」、不幸的遭遇，其「大用」、幸運所在。\n\n〈德充符〉提供的情傷疫苗與用情典範\n\n        〈德充符〉得見多位樹立一己之餘，已然可以帶給眾人美好影響的人。莊子先講了三個迷人男子的故事，他們正好有共通的心靈特質──明白事物本來就會遷化。他們不是放棄一切，而是放下成見，而注意、看重那隱藏在萬物生滅變化、離合聚散後的永恆存在¬¬──生命最根本、最重要的心靈。\n        莊子再舉三位男主角的例子，他們雖然沒有權位、財富、學識，且相貌奇醜，但是為什麼受歡迎呢？原來，人活天地間最重要的才能，是在與外界交流溝通時心靈能不因此失去平和、喜樂。原來，人與人之間，最讓你想親近對方的理由，是性情、是精神、是心。都說，人在江湖。莊子卻說，人能自由。活在一人之力難以操控的人間世，只有心靈，經由不斷陶養、不斷進步是可以絕對自主的。一個心靈能維持平靜安和，德性又不彰顯於外的人，萬物都想與他親近，難以離開。\n        愛情不難。愛對人，最難。像是愛他、又好像不是。心動，就該行動了嗎？究竟該繼續緊握這雙手？還是該毫不留戀地往前走？──莊子陶養你看人的眼光，點出：沒有器量，就沒有體諒。什麼樣的對待值得偕行一程？什麼樣的人值得共度一生？──莊子說，是情深似海、愛厚如洋。原來相愛最關鍵的元素，是精神、是靈魂。\n        想愛，卻愛得傷神，隨他而去的心要如何追回？凋零的人要如何回春？──莊子提供一系列情傷急救設備，有「不以好惡內傷」疫苗、「用心若鏡」OK繃、「安之若命」止血劑、「心齋神凝」葉克膜，供君取用。\n\n        有一種處人魅力，不慍不執，愛而無傷。\n        有一種處世智慧，不卑不亢，勇於不敢。\n        寂寞幽昧的人生，幸有莊子偕行。\n\n        世界夠黑，人才懂得：可以把心點亮。\n        情傷太重，人才甘願：學習補強此心。\n        職場乏了，你才想聽：怎樣溝通才能不累？\n        寂寞幽昧的旅程，恰是選擇開啟閉鎖已久心門、重拾滿室輝光的契機。\n        遠路才是近路。絕處才易逢春。\n        正是時候，讀《莊子》。\n\n-----------------------------------------------------------------------------------------------------------------------------------\n\n本課程之學習目標，主要可以概括以下三點： \n一、經由代表性作品的選讀，使學生對中國的人文傳統有深一層的認識。 \n二、經由對經典性文獻的研討分析過程，使學生熟悉人文思維的程序與方法。 \n三、經由寫作練習，一方面增長學生的思考以及文字的表達能力，一方面促進學生對於一己生命的自覺，而導向成熟人生觀的建立。",
    "what_you_learn": "",
    "instructors": [
      "biming"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zika-e-doencas-emergentes",
    "name": "Compreendendo o Zika e doenças emergentes",
    "content": "Através deste curso você vai saber porque tantas doenças que surgiram atualmente (doenças emergentes) são causadas por vírus, como elas surgem e se espalham. Veremos como vírus causadores de doenças entram em contato com o ser humano e como se espalham, principalmente aqueles transmitidos por mosquitos, como os vírus da Dengue e Zika. Você será capaz de identificar como e onde o Zika vírus começou a causar a atual pandemia, entenderá como ele circula e quais os sintomas que causa nas pessoas em geral e em gestantes e particular, com ênfase na microcefalia.Se você é um profissional da saúde ou só um curioso, ofereceremos aulas relevantes para todos estes públicos. Você também aprenderá como combatemos o Zika vírus, tanto através do controle dos mosquitos quanto pelo desenvolvimento de vacinas. E como boatos sobre essa doença surgiram e circularam na internet. Ao final do curso você terá a informação atualizada sobre o que sabemos e não sabemos sobre o Zika, bem como os próximos passos da ciência para conter esse vírus.\n\nSe você é professora ou professor e está interessado em tratar o Zika em sala de aula, também teremos aulas e material que vão lhe preparar para tratar sobre Zika em aula.",
    "what_you_learn": "",
    "instructors": [
      "atilaiamarino",
      "~34727962"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zn-and-ni-based-batteries",
    "name": "Zn and Ni Based Batteries",
    "content": "Zn and Ni based Batteries: This course focuses on identifying active materials, chemistry and manufacturing processes as they relate to Zn as well as Ni batteries Battery selection and sizing for various applications.",
    "what_you_learn": "Participants will learn active materials, chemistry and manufacturing processes in various Zn and Ni battery selection and size applications.\nParticipants will learn active materials, chemistry and manufacturing processes in various Zn and Ni battery selection and size applications.",
    "instructors": [
      "~128526422"
    ]
  },
  {
    "url": "https://www.coursera.org/learn/zos-system-services-structure",
    "name": "z/OS System Services Structure",
    "content": "This course presents the structure and control blocks of the z/OS BCP and system services. It prepares the new z/OS system programmer to identify potential bottlenecks and performance problems, perform initial error symptom gathering, and identify opportunities and requirements for tailoring an z/OS system. This course also provides prerequisite information needed for further training in specialized areas such as system measurement and tuning and system problem determination.",
    "what_you_learn": "",
    "instructors": [
      "~31623304"
    ]
  }
]